tokihk/sdbox/env/nxp_mimxrt1180_evk_mcuxpressoide/system_cm7_sa/drivers/fsl_dcdc.h
/*******************************************************************************
 * API
 ******************************************************************************/
/*!
 * @name Initialization and De-initialization Interfaces
 * @{
 */

/*!
 * @brief Initializes the basic resource of DCDC module, such as control mode, etc.
 *
 * @param base DCDC peripheral base address.
 * @param config Pointer to the @ref dcdc_config_t structure.
 */
void DCDC_Init(DCDC_Type *base, const dcdc_config_t *config);

/*!
 * @brief De-initializes the DCDC module.
 *
 * @param base DCDC peripheral base address.
 */
void DCDC_Deinit(DCDC_Type *base);

/*!
 * @brief Gets the default setting for DCDC, such as control mode, etc.
 *
 * This function initializes the user configuration structure to a default value. The default values are:
 * @code
 *   config->controlMode                    = kDCDC_StaticControl;
 *   config->trimInputMode                  = kDCDC_SampleTrimInput;
 *   config->enableDcdcTimeout              = false;
 *   config->enableSwitchingConverterOutput = false;
 * @endcode
 *
 * @param config Pointer to configuration structure. See to @ref dcdc_config_t.
 */
void DCDC_GetDefaultConfig(dcdc_config_t *config);

/*! @} */

/*!
 * @name Power Mode Related Interfaces
 * @{
 */

/*! @} */

/*!
 * @name Outputs' Target Voltage Related Interfaces
 * @{
 */

static inline void DCDC_SetVDD1P0LowPowerModeTargetVoltage(DCDC_Type *base,
                                                           dcdc_core_slice_t core,
                                                           dcdc_1P0_target_vol_t targetVoltage)
{
    base->REG3 &= ~DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK;

    if (core == kDCDC_CORE0)
    {
        base->TRG_SW_0 = ((base->TRG_SW_0) & (~DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG_MASK)) |
                         DCDC_TRG_SW_0_VDD1P0CTRL_LP_TRG(targetVoltage);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_SW_1 = ((base->TRG_SW_1) & (~DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG_MASK)) |
                         DCDC_TRG_SW_1_VDD1P0CTRL_LP_TRG(targetVoltage);
    }
    else
    {
        assert(0);
    }

    /*
     * REG0[STS_DC_OK] should be checked after 3 rising edge of 32K clock,
     * so wait 4 cycles of 32K clock, maximum 123us.
     */
#if (__CORTEX_M == 7)
    SDK_DelayAtLeastUs(123, CLOCK_GetRootClockFreq(kCLOCK_Root_M7));
#else
    SDK_DelayAtLeastUs(123, CLOCK_GetRootClockFreq(kCLOCK_Root_M33));
#endif

    while (DCDC_REG0_STS_DC_OK_MASK != (DCDC_REG0_STS_DC_OK_MASK & base->REG0))
    {
    }
}

/*!
 * @brief Gets the target value of VDD1P0 in low power mode, the result takes "mV" as the unit.
 *
 * @param base DCDC peripheral base address.
 *
 * @return The VDD1P0's voltage value in low power mode and the unit is "mV".
 */
static inline uint16_t DCDC_GetVDD1P0LowPowerModeTargetVoltage(DCDC_Type *base)
{
    const uint16_t vdd1P0TargetVoltage[] = VDD1P0_TARGET_VOLTAGE;
    uint32_t voltageValue =
        (base->CURRENT_TRG & DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_MASK) >> DCDC_CURRENT_TRG_VDD1P0CTRL_LP_TRG_SHIFT;

    return vdd1P0TargetVoltage[voltageValue];
}

static inline void DCDC_EnableVDD1P0LowPowerMode(DCDC_Type *base, dcdc_core_slice_t core, bool enable)
{
    if (core == kDCDC_CORE0)
    {
        base->TRG_SW_0 = ((base->TRG_SW_0) & (~DCDC_TRG_SW_0_LP_EN_1P0_MASK)) | DCDC_TRG_SW_0_LP_EN_1P0(enable);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_SW_1 = ((base->TRG_SW_1) & (~DCDC_TRG_SW_1_LP_EN_1P0_MASK)) | DCDC_TRG_SW_1_LP_EN_1P0(enable);
    }
    else
    {
        assert(0);
    }
}

/*!
 * @brief Sets the target value(ranges from 0.6V to 1.375V) of VDD1P0 in buck mode, 25mV each step.
 *
 * @param base DCDC peripheral base address.
 * @param core Core for DCDC to control.
 * @param targetVoltage The target value of VDD1P0 in buck mode, see @ref dcdc_1P0_target_vol_t.
 */
static inline void DCDC_SetVDD1P0BuckModeTargetVoltage(DCDC_Type *base,
                                                       dcdc_core_slice_t core,
                                                       dcdc_1P0_target_vol_t targetVoltage)
{
    base->REG3 &= ~DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK;

    if (core == kDCDC_CORE0)
    {
        base->TRG_SW_0 =
            ((base->TRG_SW_0) & (~DCDC_TRG_SW_0_VDD1P0CTRL_TRG_MASK)) | DCDC_TRG_SW_0_VDD1P0CTRL_TRG(targetVoltage);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_SW_1 =
            ((base->TRG_SW_1) & (~DCDC_TRG_SW_1_VDD1P0CTRL_TRG_MASK)) | DCDC_TRG_SW_1_VDD1P0CTRL_TRG(targetVoltage);
    }
    else
    {
        assert(0);
    }

    /*
     * REG0[STS_DC_OK] should be checked after 3 rising edge of 32K clock,
     * so wait 4 cycles of 32K clock, maximum 123us.
     */
#if (__CORTEX_M == 7)
    SDK_DelayAtLeastUs(123, CLOCK_GetRootClockFreq(kCLOCK_Root_M7));
#else
    SDK_DelayAtLeastUs(123, CLOCK_GetRootClockFreq(kCLOCK_Root_M33));
#endif

    while (DCDC_REG0_STS_DC_OK_MASK != (DCDC_REG0_STS_DC_OK_MASK & base->REG0))
    {
    }
}

/*!
 * @brief Gets the target value of VDD1P0 in buck mode, the result takes "mV" as the unit.
 *
 * @param base DCDC peripheral base address.
 *
 * @return The VDD1P0's voltage value in buck mode and the unit is "mV".
 */
static inline uint16_t DCDC_GetVDD1P0BuckModeTargetVoltage(DCDC_Type *base)
{
    const uint16_t vdd1P0TargetVoltage[] = VDD1P0_TARGET_VOLTAGE;
    uint32_t voltageValue =
        (base->CURRENT_TRG & DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_MASK) >> DCDC_CURRENT_TRG_VDD1P0CTRL_TRG_SHIFT;

    return vdd1P0TargetVoltage[voltageValue];
}

static inline void DCDC_GPC_SetVDD1P0BuckModeTargetVoltage(DCDC_Type *base,
                                                           dcdc_core_slice_t core,
                                                           dcdc_1P0_target_vol_t targetVoltage)
{
    if (core == kDCDC_CORE0)
    {
        base->TRG_GPC_0 =
            ((base->TRG_GPC_0) & (~DCDC_TRG_GPC_0_VDD1P0CTRL_TRG_MASK)) | DCDC_TRG_GPC_0_VDD1P0CTRL_TRG(targetVoltage);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_GPC_1 =
            ((base->TRG_GPC_1) & (~DCDC_TRG_GPC_1_VDD1P0CTRL_TRG_MASK)) | DCDC_TRG_GPC_1_VDD1P0CTRL_TRG(targetVoltage);
    }
    else
    {
        assert(0);
    }
}

/*!
 * @brief Sets the target value(ranges from 0.625V to 1.4V) of VDD1P0 in low power mode, 25mV each step.
 *
 * @param base DCDC peripheral base address.
 * @param core Core for DCDC to control.
 * @param targetVoltage The target value of VDD1P0 in low power mode, see @ref dcdc_1P0_target_vol_t.
 */
static inline void DCDC_GPC_SetVDD1P0LowPowerModeTargetVoltage(DCDC_Type *base,
                                                               dcdc_core_slice_t core,
                                                               dcdc_1P0_target_vol_t targetVoltage)
{
    if (core == kDCDC_CORE0)
    {
        base->TRG_GPC_0 = ((base->TRG_GPC_0) & (~DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG_MASK)) |
                          DCDC_TRG_GPC_0_VDD1P0CTRL_LP_TRG(targetVoltage);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_GPC_1 = ((base->TRG_GPC_1) & (~DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG_MASK)) |
                          DCDC_TRG_GPC_1_VDD1P0CTRL_LP_TRG(targetVoltage);
    }
    else
    {
        assert(0);
    }
}

/*!
 * @brief Enable VDD1P0 in low power mode.
 *
 * @param base DCDC peripheral base address.
 * @param core Core for DCDC to control.
 * @param enable Enable the output or not.
 */
static inline void DCDC_GPC_EnableVDD1P0LowPowerMode(DCDC_Type *base, dcdc_core_slice_t core, bool enable)
{
    if (core == kDCDC_CORE0)
    {
        base->TRG_GPC_0 = ((base->TRG_GPC_0) & (~DCDC_TRG_GPC_0_LP_EN_1P0_MASK)) | DCDC_TRG_GPC_0_LP_EN_1P0(enable);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_GPC_1 = ((base->TRG_GPC_1) & (~DCDC_TRG_GPC_1_LP_EN_1P0_MASK)) | DCDC_TRG_GPC_1_LP_EN_1P0(enable);
    }
    else
    {
        assert(0);
    }
}

/*!
 * @brief Sets the target value(ranges from 1.5V to 2.275V) of VDD1P8, 25mV each step.
 *
 * @param base DCDC peripheral base address.
 * @param core Core for DCDC to control.
 * @param targetVoltage The target value of VDD1P8, see @ref dcdc_1P8_target_vol_t.
 */
static inline void DCDC_SetVDD1P8TargetVoltage(DCDC_Type *base,
                                               dcdc_core_slice_t core,
                                               dcdc_1P8_target_vol_t targetVoltage)
{
    if (core == kDCDC_CORE0)
    {
        base->TRG_SW_0 =
            ((base->TRG_SW_0) & (~DCDC_TRG_SW_0_VDD1P8CTRL_TRG_MASK)) | DCDC_TRG_SW_0_VDD1P8CTRL_TRG(targetVoltage);
    }
    else if (core == kDCDC_CORE1)
    {
        base->TRG_SW_1 =
            ((base->TRG_SW_1) & (~DCDC_TRG_SW_1_VDD1P8CTRL_TRG_MASK)) | DCDC_TRG_SW_1_VDD1P8CTRL_TRG(targetVoltage);
    }
    else
    {
        assert(0);
    }
}

/*!
 * @brief Gets the target value of VDD1P8, the result takes "mV" as the unit.
 *
 * @param base DCDC peripheral base address.
 *
 * @return The VDD1P8's voltage value and the unit is "mV".
 */
static inline uint16_t DCDC_GetVDD1P8TargetVoltage(DCDC_Type *base)
{
    const uint16_t vdd1P8TargetVoltage[] = VDD1P8_TARGET_VOLTAGE;
    uint32_t voltageValue =
        (base->CURRENT_TRG & DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_MASK) >> DCDC_CURRENT_TRG_VDD1P8CTRL_TRG_SHIFT;

    return vdd1P8TargetVoltage[voltageValue];
}

/*!
 * @brief Enables/Disables stepping for VDD1P0, before entering low power modes the stepping for VDD1P0 must be
 * disabled.
 *
 * @param base DCDC peripheral base address.
 * @param enable Used to control the behavior.
 *            - \b true Enables stepping for VDD1P0.
 *            - \b false Disables stepping for VDD1P0.
 */
static inline void DCDC_EnableVDD1P0TargetVoltageStepping(DCDC_Type *base, bool enable)
{
    if (enable)
    {
        base->REG3 &= ~DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK;
    }
    else
    {
        base->REG3 |= DCDC_REG3_VDD1P0CTRL_DISABLE_STEP_MASK;
    }
}

/*! @} */

/*!
 * @name Detection Related Inferfaces
 * @{
 */

/*!
 * @brief Gets the default setting for detection configuration.
 *
 * The default configuration are set according to responding registers' setting when powered on.
 * They are:
 * @code
 *   config->enableXtalokDetection = false;
 *   config->powerDownOverVoltageVdd1P8Detection = true;
 *   config->powerDownOverVoltageVdd1P0Detection = true;
 *   config->powerDownLowVoltageDetection  = false;
 *   config->powerDownOverCurrentDetection = true;
 *   config->powerDownPeakCurrentDetection = true;
 *   config->powerDownZeroCrossDetection   = true;
 *   config->OverCurrentThreshold          = kDCDC_OverCurrentThresholdAlt0;
 *   config->PeakCurrentThreshold          = kDCDC_PeakCurrentThresholdAlt0;
 * @endcode
 *
 * @param config Pointer to configuration structure. See to @ref dcdc_detection_config_t.
 */
void DCDC_GetDefaultDetectionConfig(dcdc_detection_config_t *config);

/*!
 * @brief Configures the DCDC detection.
 *
 * @param base DCDC peripheral base address.
 * @param config Pointer to configuration structure. See to @ref dcdc_detection_config_t.
 */
void DCDC_SetDetectionConfig(DCDC_Type *base, const dcdc_detection_config_t *config);

/*! @} */

/*!
 * @name DCDC Miscellaneous Inferfaces
 * @{
 */

/*!
 * @brief Configures the DCDC clock source.
 *
 * @param base DCDC peripheral base address.
 * @param clockSource Clock source for DCDC. See to @ref dcdc_clock_source_t.
 */
void DCDC_SetClockSource(DCDC_Type *base, dcdc_clock_source_t clockSource);

/*!
 * @brief Sets the bangap trim value(0~31) to trim bandgap voltage.
 *
 * @param base DCDC peripheral base address.
 * @param trimValue The bangap trim value. Available range is 0U-31U.
 */
static inline void DCDC_SetBandgapVoltageTrimValue(DCDC_Type *base, uint32_t trimValue)
{
    base->REG1 &= ~DCDC_REG1_VBG_TRIM_MASK;
    base->REG1 |= DCDC_REG1_VBG_TRIM(trimValue);
}

/*!
 * @brief Gets the default setting for loop control configuration.
 *
 * The default configuration are set according to responding registers' setting when powered on.
 * They are:
 * @code
 *   config->enableCommonHysteresis = false;
 *   config->enableCommonThresholdDetection = false;
 *   config->enableInvertHysteresisSign = false;
 *   config->enableRCThresholdDetection = false;
 *   config->enableRCScaleCircuit = 0U;
 *   config->complementFeedForwardStep = 0U;
 *   config->controlParameterMagnitude = 2U;
 *   config->integralProportionalRatio = 2U;
 * @endcode
 *
 * @param config Pointer to configuration structure. See to @ref dcdc_loop_control_config_t.
 */
void DCDC_GetDefaultLoopControlConfig(dcdc_loop_control_config_t *config);

/*!
 * @brief Configures the DCDC loop control.
 *
 * @param base DCDC peripheral base address.
 * @param config Pointer to configuration structure. See to @ref dcdc_loop_control_config_t.
 */
void DCDC_SetLoopControlConfig(DCDC_Type *base, const dcdc_loop_control_config_t *config);

/*!
 * @brief Configures the DCDC internal regulator.
 *
 * @param base DCDC peripheral base address.
 * @param config Pointer to configuration structure. See to @ref dcdc_internal_regulator_config_t.
 */
void DCDC_SetInternalRegulatorConfig(DCDC_Type *base, const dcdc_internal_regulator_config_t *config);

/*!
 * @brief Adjusts delay to reduce ground noise.
 *
 * @param base DCDC peripheral base address.
 * @param enable Enable the feature or not.
 */
static inline void DCDC_EnableAdjustDelay(DCDC_Type *base, bool enable)
{
    if (enable)
    {
        base->REG3 |= DCDC_REG3_MISC_DELAY_TIMING_MASK;
    }
    else
    {
        base->REG3 &= ~DCDC_REG3_MISC_DELAY_TIMING_MASK;
    }
}

/*! @} */

/*!
 * @name DCDC Status Related Interfaces
 * @{
 */

/*!
 * @brief Get DCDC status flags.
 *
 * @param base peripheral base address.
 * @return Mask of asserted status flags. See to @ref _dcdc_status_flags.
 */
static inline uint32_t DCDC_GetStatusFlags(DCDC_Type *base)
{
    return (base->REG0 & DCDC_REG0_STS_DC_OK_MASK);
}

/* @} */

/*!
 * @name Application Guideline Interfaces
 * @{
 */

/*!
 * @brief Boots DCDC into CCM(continous conduction mode).
 *
 * @code
 *  pwd_zcd=0x1;
 *  pwd_cmp_offset=0x0;
 *  dcdc_loopctrl_en_rcscale=0x3;
 * @endcode
 *
 * @param base DCDC peripheral base address.
 */
void DCDC_BootIntoCCM(DCDC_Type *base);

/*! @} */

/*!
 * @}
 */

#endif /* __FSL_DCDC_H__ */
